## dev: ses
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 4 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.platform_mvp_dmarc will be created
  + resource "aws_route53_record" "platform_mvp_dmarc" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_dmarc.platform.cdssandbox.xyz"
      + records         = [
          + "v=DMARC1; p=none; rua=mailto:platform+platform-cms@cds-snc.ca;",
        ]
      + ttl             = 600
      + type            = "TXT"
      + zone_id         = "Z0827871K14BE7AFQQHA"
    }

  # aws_route53_record.platform_mvp_mx_send_mail_from will be created
  + resource "aws_route53_record" "platform_mvp_mx_send_mail_from" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "mail.platform.cdssandbox.xyz"
      + records         = [
          + "10 feedback-smtp.ca-central-1.amazonses.com",
        ]
      + ttl             = 600
      + type            = "MX"
      + zone_id         = "Z0827871K14BE7AFQQHA"
    }

  # aws_route53_record.platform_mvp_spf_domain will be created
  + resource "aws_route53_record" "platform_mvp_spf_domain" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "platform.cdssandbox.xyz"
      + records         = [
          + "v=spf1 include:amazonses.com -all",
        ]
      + ttl             = 600
      + type            = "TXT"
      + zone_id         = "Z0827871K14BE7AFQQHA"
    }

  # aws_route53_record.platform_mvp_spf_mail_from will be created
  + resource "aws_route53_record" "platform_mvp_spf_mail_from" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "mail.platform.cdssandbox.xyz"
      + records         = [
          + "v=spf1 include:amazonses.com -all",
        ]
      + ttl             = 600
      + type            = "TXT"
      + zone_id         = "Z0827871K14BE7AFQQHA"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>